#pragma execution_character_set("utf-8")
#include "Hypersen_30_Remote.h"
/*************************************************************************************************************************************************
**Function:    构造函数
**Others:      构造函数初始化在主线程实例化中完成，故在子线程中运行时，成员函数的初始化不能在构造函数中完成
*************************************************************************************************************************************************/
c_Hypersen_30_Remote::c_Hypersen_30_Remote(c_Hypersen_Remote *parent) : c_Hypersen_Remote(parent)
{

}
/*************************************************************************************************************************************************
**Function:    析构函数
*************************************************************************************************************************************************/
c_Hypersen_30_Remote::~c_Hypersen_30_Remote()
{
}
/*************************************************************************************************************************************************
**Function:    操作接口
*************************************************************************************************************************************************/
void c_Hypersen_30_Remote::Connect()
{
	if (m_Hypersen_Remote_State.value("Connected").toBool()) { return; }
	QObject::connect(this, &c_Hypersen_30_Remote::Read_Ready, c_Hypersen_CallBack::g_Hypersen_CallBack, &c_Hypersen_CallBack::Hypersen_30_Read_Ready);
	QString ip = c_Variable::g_Communicate_DB.value("Hypersen_30_Ip").toString();
	int port = c_Variable::g_Communicate_DB.value("Hypersen_30_Port").toInt();
	emit Connect_Device(ip, port);
}
/*************************************************************************************************************************************************
**Function:   同步接口
*************************************************************************************************************************************************/
void c_Hypersen_30_Remote::Hypersen_30_Read_Ready()
{
	emit Read_Ready(m_device_id);
}
